{
  "story_id": "article_0012",
  "headline": "Singapore expresses condolences over Philippine quake, stands ready to provide assistance",
  "body": "SINGAPORE: Singapore Prime Minister Lawrence Wong wrote to Philippine President Ferdinand Marcos Jr on Thursday (Oct 2) to express the country's condolences following the magnitude-6.9 earthquake in the Philippines. \"I am deeply saddened to learn about the loss of lives and the widespread damage caused by the earthquake that struck northern Cebu on Sep 30, 2025,\" said Mr Wong in the letter released by the Ministry of Foreign Affairs (MFA). \"On behalf of the government of Singapore, I extend my heartfelt condolences to the families of the victims, and my sincere wishes for the speedy recovery of those who were injured. \"Our thoughts are with the Philippines and its people during this difficult time,\" said Mr Wong, who is also the finance minister. He added that Singapore stands ready, as a fellow ASEAN member state and close friend of the Philippines, to assist with ongoing relief and recovery efforts. The Cebu earthquake was the country's deadliest since at least 2013. As of Thursday afternoon, the death toll stood at 72. The MFA said it is closely monitoring the situation in the Philippines and has reached out to e-registered Singaporeans in the affected area to offer any necessary consular assistance. It added that there are currently no reports of Singaporeans injured as a result of the earthquake. \"In view of possible aftershocks, Singaporeans in the affected area are advised to remain vigilant, take all necessary precautions for their personal safety, and heed the instructions of the local authorities,\" said the ministry. It strongly encouraged Singaporeans who are in or travelling to the Philippines to e-register with MFA and to buy comprehensive travel insurance. Singaporeans in the Philippines who need consular assistance can contact the Singapore Embassy in Manila or call the MFA Duty Office's 24-hour hotline at either 6379 8800 or 6379 8855.",
  "published_at": "Thu, 02 Oct 2025 18:29:00 +0800",
  "source": "channelnewsasia_business",
  "url": "https://www.channelnewsasia.com/singapore/singapore-condolences-philippines-earthquake-ready-assistance-lawrence-wong-mfa-5381746",
  "sgd_relevant": true
}